tests/api/sbeacon-assign-project-api-test.yml
config:
  target: "{{ $processEnvironment.SBEACON_API_URL }}"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalCount: 10
      name: "Warm-up - 10 users"

    # Main load test - exactly 100 users
    - duration: 120
      arrivalCount: 40
      name: "Load test - 40 users over 120 seconds"
  plugins:
    fake-data:
      randPassword:
        size: 5
  processor: "./sbeacon-assign-project-api-test.ts"

  # HTTP engine configuration
  http:
    timeout: 30
    pool: 25

scenarios:
  - name: "SBEACON Add User to Project API Test"
    weight: 100
    beforeRequest: "setVariablesForNextProject"
    flow:
      - loop:
          - post:
              url: "/dportal/admin/projects/{{ projectName }}/users"
              headers:
                Content-Type: "application/json"
                Authorization: "Bearer {{ $processEnvironment.JWT_TOKEN }}"
                User-Agent: "Artillery SBEACON Load Test"
              json:
                emails: "{{ emails }}"
              expect:
                - statusCode: [200]
        count: 10 # Test 10 different projects per virtual user