tests/api/sbeacon-indexing-project-api-test.yml
config:
  target: "{{ $processEnvironment.SBEACON_API_URL }}"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalCount: 10
      name: "Warm-up - 10 users"

    # Main load test - exactly 100 users
    - duration: 120
      arrivalCount: 40
      name: "Load test - 40 users over 120 seconds"
  plugins:
    fake-data:
      randPassword:
        size: 5

  # HTTP engine configuration
  http:
    timeout: 30
    pool: 25

scenarios:
  - name: "SBEACON indexing Project API Test"
    weight: 100
    flow:
      - post:
          url: "/dportal/admin/sbeacon/index"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ $processEnvironment.JWT_TOKEN }}"
            User-Agent: "Artillery SBEACON Load Test"
          expect:
            - statusCode: [200]