tests/api/sbeacon-ingest-project-api-test.yml
config:
  target: "{{ $processEnvironment.SBEACON_API_URL }}"
  phases:
    - duration: 120
      arrivalRate: 50 # ~100 concurrent users
      name: "Load test - 200 total requests over 100 seconds"
  plugins:
    fake-data:
      randPassword:
        size: 5
  processor: "./sbeacon-ingest-project-api-test.ts"

  # HTTP engine configuration
  http:
    timeout: 30
    pool: 25

scenarios:
  - name: "SBEACON Ingest Project API Test"
    weight: 100
    beforeRequest: "setVariablesForNextProject"
    flow:
      - loop:
          - post:
              url: "/dportal/admin/projects/{{ projectName }}/ingest/{{ datasetId }}"
              headers:
                Content-Type: "application/json"
                Authorization: "Bearer {{ $processEnvironment.JWT_TOKEN }}"
                User-Agent: "Artillery SBEACON Load Test"
              json:
                s3Payload: "{{ s3PayloadUrl }}"
                vcfLocations: "{{ vcfLocationsList }}"
              expect:
                - statusCode: [200]
        count: 10 # Test 10 different projects per virtual user