tests/api/sbeacon-run-query-api-test.yml
config:
  target: "{{ $processEnvironment.SBEACON_API_URL }}"
  phases:
    - duration: 30
      arrivalCount: 10
      name: "Load test - 200 total requests over 100 seconds"
  plugins:
    fake-data:
      randPassword:
        size: 5
  processor: "./sbeacon-run-query-api-test.ts"

  # HTTP engine configuration
  http:
    timeout: 30
    pool: 25

scenarios:
  - name: "SBEACON Ingest Project API Test"
    weight: 100
    beforeRequest: "setVariablesForNextProject"
    flow:
      - loop:
          - post:
              url: "/{{ scope }}"
              headers:
                Content-Type: "application/json"
                Authorization: "Bearer {{ $processEnvironment.JWT_TOKEN }}"
                User-Agent: "Artillery SBEACON Load Test"
              json:
                meta: "{{ meta }}"
                projects: "{{ projects }}"
                query: "{{ query }}"
              expect:
                - statusCode: [200]
        count: 3